Catalogs/НастройкиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсобыеПравилаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокСтатейЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПрямыхЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитика</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОценкиМПЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОценкиТоваровВРознице</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОценкиТоваровВРознице</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойСчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыпускПродукции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОказаниеУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректКостинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокСписанияРасходовНаСебестоимостьУслуг</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокСписанияРасходовНаСебестоимостьУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьПолуфабрикатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаСебестоимостиПроизводства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСебестоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьСебестоимостьУслугСобственнымПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособУчетаВыпускаГотовойПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаСтоимостиВыпуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоЭлементамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьРасходыПоСтатьямЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьРезервыПоСомнительнымДолгам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантБухгалтерскойОтчетности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыБухгалтерскойОтчетности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддержкаПБУ18</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПлановуюСебестоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантУчетаОтложенногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаОтложенногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиУчетаЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходыОбслуживающихПроизводствВключатьВПрочиеРасходы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбесценениеЗапасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияАвансовВыданных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОтраженияАвансовВыданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfAccounts/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfAccounts>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Catalogs/НастройкиУчетаЗатрат/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Элементы справочника являются контейнерами для хранения связанных сведений об учетной политике

#Область ПрограммныйИнтерфейс

// Конструктор объекта, позволяющего работать с базовыми настройками: просматривать, редактировать, применять.
//
// Полное имя НастройкиУчетаЗатрат можно сокращать до Настройки, когда из контекста ясно, что речь идет о НастройкиУчетаЗатрат.
//
Функция НовыйБазовыеНастройкиУчетаЗатрат() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("Контекст",                   НовыйКонтекстНастроекУчетаЗатрат()); // откуда получены настройки
	Настройки.Вставить("Ссылка",                     Справочники.НастройкиУчетаЗатрат.ПустаяСсылка());
	Настройки.Вставить("СчетаУчета",                 Новый Массив);       // элементы - ПланСчетовСсылка.Хозрасчетный
	Настройки.Вставить("Аналитика",                  Новый Соответствие); // Ключ - Счет, Значение - Массив видов субконто, имен измерений регистра бухгалтерии
	Настройки.Вставить("ОтображаемаяАналитика",      Новый Соответствие); // Аналитика, отображаемая пользователю, т.е. по которой предполагается фактическая вариативность
	Настройки.Вставить("БазаРаспределения",          Перечисления.БазыРаспределенияКосвенныхРасходов.ПустаяСсылка());
	Настройки.Вставить("ОсобыеПравилаРаспределения", НовыйОсобыеПравилаРаспределения());
	
	Возврат Настройки;
	
КонецФункции

// Проверяет, что переданные данные соответствуют по структуре настройкам учета затрат
//
// Параметры:
//  ПроверяемоеЗначение - Структура, см. НовыйБазовыеНастройкиУчетаЗатрат
// 
// Возвращаемое значение:
//  Булево - Истина, если переданное значение - настройки учета затрат
//
Функция ЭтоНастройкиУчетаЗатрат(Знач ПроверяемоеЗначение) Экспорт
	
	Если ТипЗнч(ПроверяемоеЗначение) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ЭлементБазовыхНастроек Из НовыйБазовыеНастройкиУчетаЗатрат() Цикл
		Если Не ПроверяемоеЗначение.Свойство(ЭлементБазовыхНастроек.Ключ) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Заполняет базовые настройки учета затрат значениями по умолчанию
//
// Параметры:
//  Настройки - Структура - см. НовыйБазовыеНастройкиУчетаЗатрат
//
Процедура ЗаполнитьПоУмолчанию(Настройки) Экспорт
	
	ЗаполнитьПоУмолчаниюСчетаУчета(Настройки);
	ПрименитьНастройкиПланаСчетов(Настройки.Аналитика, Настройки.ОтображаемаяАналитика, Настройки.СчетаУчета);
	Настройки.БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ПрямыеЗатраты;
	
КонецПроцедуры

// Валидирует базовые настройки учета затрат. Незаполненные приводятся к значениям по умолчанию
//
// Параметры:
//  Настройки - Структура - см. НовыйБазовыеНастройкиУчетаЗатрат
//
Процедура Исправить(Настройки) Экспорт
	
	ИменаКоллекцийАналитики = Новый Массив; // Обрабатываемые коллекции, см. НовыйБазовыеНастройкиУчетаЗатрат
	ИменаКоллекцийАналитики.Добавить("Аналитика");
	ИменаКоллекцийАналитики.Добавить("ОтображаемаяАналитика");
		
	Если Не ЗначениеЗаполнено(Настройки.СчетаУчета) Тогда
		
		Для Каждого ИмяКоллекции Из ИменаКоллекцийАналитики Цикл
			Настройки[ИмяКоллекции].Очистить();
		КонецЦикла;
		
		ЗаполнитьПоУмолчанию(Настройки);
		Возврат;
		
	КонецЕсли;
		
	КонтрольныеНастройки = НовыйБазовыеНастройкиУчетаЗатрат();
	ЗаполнитьПоУмолчанию(КонтрольныеНастройки);
	
	Если Не ЗначениеЗаполнено(Настройки.БазаРаспределения) Тогда
		Настройки.БазаРаспределения = КонтрольныеНастройки.БазаРаспределения;
	КонецЕсли;
	
	КонтрольныеНастройки.СчетаУчета = Настройки.СчетаУчета;
	ПрименитьНастройкиПланаСчетов(
		КонтрольныеНастройки.Аналитика,
		КонтрольныеНастройки.ОтображаемаяАналитика,
		КонтрольныеНастройки.СчетаУчета);
		
	Для Каждого ИмяКоллекции Из ИменаКоллекцийАналитики Цикл
		
		Для Каждого Счет Из Настройки.СчетаУчета Цикл
			
			АналитикаСчета             = Настройки[ИмяКоллекции][Счет];
			КонтрольнаяАналитикаСчета  = КонтрольныеНастройки[ИмяКоллекции][Счет];
			Если АналитикаСчета = Неопределено Тогда
				// Убедимся, что для всех счетов определена аналитика
				Настройки[ИмяКоллекции].Вставить(Счет, КонтрольнаяАналитикаСчета);
			Иначе
				
				// Убедимся, что нет недопустимых для счета видов аналитики
				КоличествоЭлементов = АналитикаСчета.Количество();
				Для НомерСКонца = 1 По КоличествоЭлементов Цикл
					Индекс = КоличествоЭлементов - НомерСКонца;
					Если КонтрольнаяАналитикаСчета.Найти(АналитикаСчета[Индекс]) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					АналитикаСчета.Удалить(Индекс);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла; //По счетам
		
	КонецЦикла; // По ИменаКоллекцийАналитики
	
	ИсправитьПоКонтексту(Настройки);
	
КонецПроцедуры

// Читает содержимое базовых настроек учета затрат из справочника.
//
// Параметры:
//  Настройки - Структура - см. НовыйБазовыеНастройкиУчетаЗатрат, заполняемая коллекция
//  Ссылка    - СправочникСсылка.НастройкиУчетаЗатрат - читаемая ссылка. Допустимо передавать некорректную ("битую") ссылку
//
Процедура ПрочитатьСсылку(Настройки, Ссылка) Экспорт
	
	Настройки.Ссылка = Ссылка;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.СчетУчета КАК СчетУчета,
	|	Хозрасчетный.Порядок КАК Порядок,
	|	Хозрасчетный.Код КАК Код
	|ИЗ
	|	Справочник.НастройкиУчетаЗатрат.ПланСчетов КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		ПО Настройки.СчетУчета = Хозрасчетный.Ссылка
	|ГДЕ
	|	Настройки.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Код,
	|	СчетУчета";
	СчетаУчета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СчетУчета");
	
	Настройки.СчетаУчета = Новый Массив(УчетЗатрат.СчетаРасходов(СчетаУчета));
	
	Если Не ЗначениеЗаполнено(Настройки.СчетаУчета) Тогда
		ЗаполнитьПоУмолчаниюСчетаУчета(Настройки);
	КонецЕсли;
	
	ПрименитьНастройкиПланаСчетов(Настройки.Аналитика, Настройки.ОтображаемаяАналитика, Настройки.СчетаУчета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.БазаРаспределения КАК БазаРаспределения
	|ИЗ
	|	Справочник.НастройкиУчетаЗатрат КАК Настройки
	|ГДЕ
	|	Настройки.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	
	// Особые правила распределения
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.НомерСтроки КАК Ссылка,
	|	Правила.Счет КАК Счет,
	|	Правила.Подразделение КАК Подразделение,
	|	Правила.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Правила.БазаРаспределения КАК БазаРаспределения,
	|	Правила.СписокСтатейЗатрат КАК СписокСтатейЗатрат,
	|	Правила.СчетПрямыхЗатрат КАК СчетПрямыхЗатрат,
	|	Правила.ПодразделениеЗатрат КАК ПодразделениеЗатрат
	|ИЗ
	|	Справочник.НастройкиУчетаЗатрат.ОсобыеПравилаРаспределения КАК Правила
	|ГДЕ
	|	Правила.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Настройки.ОсобыеПравилаРаспределения.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает содержимое правила распределения - элемента настройки, выполненной пользователем
// (в частности, строки табличной части ОсобыеПравилаРаспределения)
//
// Параметры:
//  Настройки - Структура - см. НовыйБазовыеНастройкиУчетаЗатрат, прочитанные настройки
//  ИдентификаторНастройки - Число - номер строки особых правил распределения; 0 - общее правило распределения.
// 
// Возвращаемое значение:
//  Структура - набор полей как в табличной части ОсобыеПравилаРаспределения
//
Функция СодержимоеПравилаРаспределения(Настройки, ИдентификаторНастройки) Экспорт
	
	СодержимоеНастройки = Новый Структура;
	
	ОписаниеТабличнойЧасти = Метаданные.Справочники.НастройкиУчетаЗатрат.ТабличныеЧасти.ОсобыеПравилаРаспределения.Реквизиты;
	Для Каждого ОписаниеПоля Из ОписаниеТабличнойЧасти Цикл
		СодержимоеНастройки.Вставить(ОписаниеПоля.Имя, ОписаниеПоля.Тип.ПривестиЗначение(Неопределено));
	КонецЦикла;
	
	СодержимоеНастройки.БазаРаспределения = Настройки.БазаРаспределения;
	
	Если ИдентификаторНастройки = 0 Тогда
		Возврат СодержимоеНастройки;
	КонецЕсли;
	
	Если ИдентификаторНастройки > Настройки.ОсобыеПравилаРаспределения.Количество() Тогда
		Возврат СодержимоеНастройки;
	КонецЕсли;
	
	Правило = Настройки.ОсобыеПравилаРаспределения[ИдентификаторНастройки - 1];
	
	ЗаполнитьЗначенияСвойств(СодержимоеНастройки, Правило);
	
	Возврат СодержимоеНастройки;
	
КонецФункции

// Конструктор коллекции, предназначенной для редактирования настроек учета затрат.
// Расширяет настройки сведениями, необходимыми для записи их в информационную базу.
//
// Параметры:
//  Настройки - Структура - см. НовыйБазовыеНастройкиУчетаЗатрат настройки учета затрат
// 
// Возвращаемое значение:
//  Структура - созданная коллекция; состав свойств см. в теле функции
//
Функция НовыйРедактированиеНастроекУчетаЗатрат(Знач Настройки = Неопределено) Экспорт
	
	Если Настройки = Неопределено Тогда
		Настройки = НовыйБазовыеНастройкиУчетаЗатрат();
	КонецЕсли;
	
	РедактированиеНастроек = Новый Структура;
	РедактированиеНастроек.Вставить("Настройки",          Настройки);
	РедактированиеНастроек.Вставить("Ссылка",             ПустаяСсылка());
	РедактированиеНастроек.Вставить("Модифицированность", Ложь);
	РедактированиеНастроек.Вставить("КраткоеОписание",    Новый ФорматированнаяСтрока(""));
	
	ЗаполнитьКраткоеОписание(РедактированиеНастроек);
	
	Возврат РедактированиеНастроек;
	
КонецФункции

// Формирует (заполняет, обновляет) краткое описание настройки.
//
// Параметры:
//  РедактированиеНастроек - Структура - см. НовыйРедактированиеНастроекУчетаЗатрат
//
Процедура ЗаполнитьКраткоеОписание(РедактированиеНастроек) Экспорт
	
	// Пока описание включает лишь перечень счетов
	
	Если Не ЗначениеЗаполнено(РедактированиеНастроек.Настройки.СчетаУчета) Тогда
		
		ОписаниеHTML = СтрШаблон(НСтр("ru = 'Счета учета затрат: <a href = ""%1"">Настроить</a>'"), ИмяКомандыСчетаУчета());
		
	ИначеЕсли РедактированиеНастроек.Настройки.СчетаУчета.Количество() = 1 Тогда
		
		СчетУчета = РедактированиеНастроек.Настройки.СчетаУчета[0];
		
		ЭлементыПредставления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетУчета, "Код, Наименование");
		
		ПредставлениеСчета = ПланыСчетов.Хозрасчетный.ПолноеПредставлениеСчета(
			СчетУчета,
			ЭлементыПредставления.Код,
			ЭлементыПредставления.Наименование);
		
		ОписаниеHTML = СтрШаблон(
			НСтр("ru = 'Затраты учитываются на счете <a href = ""%1"">%2</a>'"),
			ИмяКомандыСчетаУчета(),
			ПредставлениеСчета);
			
	Иначе
		
		ЭлементыПредставлений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(РедактированиеНастроек.Настройки.СчетаУчета, "Код");
		
		КодыСчетов = Новый Массив;
		Для Каждого Счет Из РедактированиеНастроек.Настройки.СчетаУчета Цикл
			КодСчета = ЭлементыПредставлений[Счет];
			Если КодСчета = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			КодыСчетов.Добавить(КодСчета);
		КонецЦикла;
		
		ОписаниеHTML = СтрШаблон(
			НСтр("ru = 'Затраты учитываются на счетах <a href = ""%1"">%2</a>'"),
			ИмяКомандыСчетаУчета(),
			ОбщегоНазначенияБПКлиентСервер.ПредставлениеСписка(КодыСчетов));
		
	КонецЕсли;
	
	РедактированиеНастроек.КраткоеОписание = СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(ОписаниеHTML);
	
КонецПроцедуры

// Определяет счета учета, для которых можно настроить особые правила распределения затрат
// 
// Возвращаемое значение:
//  Массив Из ПланСчетовСсылка.Хозрасчетный
//
Функция НастраиваемыеСчетаОсобыеПравилаРаспределения() Экспорт
	
	Возврат БухгалтерскийУчет.СформироватьМассивСубсчетов(ПредопределенныеСчетаПравилаРаспределения());
	
КонецФункции

// Определяет предопределенные счета учета, для которых можно настроить правила распределения затрат
// 
// Возвращаемое значение:
//  Массив Из ПланСчетовСсылка.Хозрасчетный
//
Функция ПредопределенныеСчетаПравилаРаспределения() Экспорт
	
	СчетаУчета = Новый Массив;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаУчета, УчетЗатрат.ПредопределенныеСчетаКосвенныхРасходов());
	РасширеннаяАналитикаЗатрат.ДобавитьСчетБракВПроизводстве(СчетаУчета);
	
	Возврат СчетаУчета;
	
КонецФункции

// Проверяет наличие ошибок при настройке базы распределения ОтдельныеСтатьиПрямыхЗатрат
//
// Параметры:
//  Ошибки    - ДеревоЗначений - коллекция будет дополнена результатом проверки
//  Настройки - НовыйБазовыеНастройкиУчетаЗатрат - проверяемые настройки
//
Процедура ПроверитьЗаполненСписокСтатейЗатрат(Ошибки, Настройки) Экспорт
	
	СпискиСтатейЗатрат = Новый Соответствие; // Ключ - список, Значение - массив настроек
	
	Для Каждого ДетальнаяНастройка Из Настройки.ОсобыеПравилаРаспределения Цикл
		
		Если ДетальнаяНастройка.БазаРаспределения <> Перечисления.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат Тогда
			Продолжить;
		КонецЕсли;
		
		ПрименениеСписка = СпискиСтатейЗатрат[ДетальнаяНастройка.СписокСтатейЗатрат];
		Если ПрименениеСписка = Неопределено Тогда
			ПрименениеСписка = Новый Массив;
			СпискиСтатейЗатрат.Вставить(ДетальнаяНастройка.СписокСтатейЗатрат, ПрименениеСписка);
		КонецЕсли;
		
		ПрименениеСписка.Добавить(ДетальнаяНастройка);
		
	КонецЦикла;
	
	// Не указан список
	СписокНеУказан = СпискиСтатейЗатрат[Справочники.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка()];
	Если СписокНеУказан <> Неопределено Тогда
		
		Ошибка = ВыводСообщенийОбОшибках.ДобавитьПростоеОписаниеОшибки(Ошибки);
		Ошибка.Описание = НСтр("ru = 'Не указан список статей затрат базы распределения ""Отдельные статьи прямых затрат"".'");
		
		Ошибка.Локализация = НСтр("ru = 'Проверьте особые правила распределения косвенных затрат:'");
		Ошибка.Ссылка      = СсылкаУчетнаяПолитика(Настройки);
		
		Для Каждого Правило Из СписокНеУказан Цикл
			
			МестоОшибки = Ошибка.ЛокализацияДетально.Добавить();
			МестоОшибки.Локализация = СтрШаблон(НСтр("ru = 'Строка %1'"), Правило.Ссылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Указан пустой список
	
	СпискиСтатейЗатратМассив = Новый Массив;
	Для Каждого ОписаниеСписка Из СпискиСтатейЗатрат Цикл
		
		Если Не ЗначениеЗаполнено(ОписаниеСписка.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		СпискиСтатейЗатратМассив.Добавить(ОписаниеСписка.Ключ);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СпискиСтатейЗатрат", СпискиСтатейЗатратМассив);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Списки.Ссылка КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Списки.Ссылка) КАК Представление
	|ИЗ
	|	Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов КАК Списки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.СтатьиЗатрат КАК СодержаниеСписка
	|		ПО Списки.Ссылка = СодержаниеСписка.Ссылка
	|ГДЕ
	|	Списки.Ссылка В(&СпискиСтатейЗатрат)
	|	И СодержаниеСписка.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ошибка = ВыводСообщенийОбОшибках.ДобавитьПростоеОписаниеОшибки(Ошибки);
		Ошибка.Описание = СтрШаблон(НСтр("ru = 'Не заполнен список статей затрат %1.'"), Выборка.Представление);
		
		Ошибка.Локализация = НСтр("ru = 'Проверьте особые правила распределения косвенных затрат:'");
		Ошибка.Ссылка      = СсылкаУчетнаяПолитика(Настройки);
		
		Для Каждого Правило Из СпискиСтатейЗатрат[Выборка.Ссылка] Цикл
			
			МестоОшибки = Ошибка.ЛокализацияДетально.Добавить();
			МестоОшибки.Локализация = СтрШаблон(НСтр("ru = 'Строка %1'"), Правило.Ссылка);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ПодключениеПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйКонтекстНастроекУчетаЗатрат()
	
	Контекст = Новый Структура;
	Контекст.Вставить("Период",      '0001-01-01');
	Контекст.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Возврат Контекст;
	
КонецФункции

Функция НовыйОсобыеПравилаРаспределения()
	
	Правила = Новый ТаблицаЗначений;
	
	ШаблонКолонок = Метаданные.Справочники.НастройкиУчетаЗатрат.ТабличныеЧасти.ОсобыеПравилаРаспределения.Реквизиты;
	Для Каждого МетаданныеКолонки Из ШаблонКолонок Цикл
		Правила.Колонки.Добавить(МетаданныеКолонки.Имя, МетаданныеКолонки.Тип);
	КонецЦикла;
	
	Правила.Колонки.Добавить("Ссылка", ОбщегоНазначения.ОписаниеТипаСтрока(5));
	
	Возврат Правила;
	
КонецФункции

Функция ИмяКомандыСчетаУчета()
	
	Возврат "СчетаУчетаЗатрат"; // должно совпадать с именем формы
	
КонецФункции

Процедура ЗаполнитьПоУмолчаниюСчетаУчета(Настройки)
	
	ОсновнойСчет = ПланыСчетов.Хозрасчетный.ОсновнойСчет("Затраты");
	Субсчета = УчетЗатрат.СчетаРасходов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОсновнойСчет));
	Если Не ЗначениеЗаполнено(Субсчета) Тогда
		Настройки.СчетаУчета.Добавить(ОсновнойСчет);
	Иначе
		Настройки.СчетаУчета.Добавить(Субсчета[0]);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрименитьНастройкиПланаСчетов(АналитикаСчетов, ОтображаемаяАналитикаСчетов, СчетаУчета)
	
	Для Каждого Счет Из СчетаУчета Цикл
		АналитикаСчетов.Вставить(Счет, Новый Массив);
		ОтображаемаяАналитикаСчетов.Вставить(Счет, Новый Массив);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СчетаУчета",              СчетаУчета);
	Запрос.УстановитьПараметр("НеиспользуемаяАналитика", ПланыСчетов.Хозрасчетный.НеиспользуемаяАналитика());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет,
	|	ХозрасчетныйВидыСубконто.ВидСубконто КАК ВидАналитикиЗатрат,
	|	ХозрасчетныйВидыСубконто.НомерСтроки КАК Порядок,
	|	НЕ ХозрасчетныйВидыСубконто.ВидСубконто В (&НеиспользуемаяАналитика) КАК Отображаемая
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.Ссылка В(&СчетаУчета)
	|	И ХозрасчетныйВидыСубконто.Суммовой
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Хозрасчетный.Ссылка,
	|	""Подразделение"",
	|	0,
	|	ИСТИНА
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В(&СчетаУчета)
	|	И Хозрасчетный.УчетПоПодразделениям
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		АналитикаСчета = АналитикаСчетов[Выборка.Счет];
		Если АналитикаСчета <> Неопределено Тогда
			АналитикаСчета.Добавить(Выборка.ВидАналитикиЗатрат);
		КонецЕсли;
		
		Если Не Выборка.Отображаемая Тогда
			Продолжить;
		КонецЕсли;
		
		ОтображаемаяАналитикаСчета = ОтображаемаяАналитикаСчетов[Выборка.Счет];
		Если ОтображаемаяАналитикаСчета <> Неопределено Тогда
			ОтображаемаяАналитикаСчета.Добавить(Выборка.ВидАналитикиЗатрат);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СсылкаУчетнаяПолитика(Настройки)
	
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(Настройки.Контекст);
	КлючЗаписи = Новый(Тип("РегистрСведенийКлючЗаписи.УчетнаяПолитика"), ПараметрыКонструктора);
	Возврат ПолучитьНавигационнуюСсылку(КлючЗаписи);
	
КонецФункции

Процедура ИсправитьПоКонтексту(Настройки)
	
	Если Не ЗначениеЗаполнено(Настройки.Контекст.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	// Убедимся, что выбранные подразделения соответствуют организации
	
	ПоляПодразделение = Новый Массив;
	ПоляПодразделение.Добавить("Подразделение");
	ПоляПодразделение.Добавить("ПодразделениеЗатрат");
	
	ВыбранныеПодразделения = Новый Соответствие;
	Для Каждого Правило Из Настройки.ОсобыеПравилаРаспределения Цикл
		
		Для Каждого ИмяПоля Из ПоляПодразделение Цикл
			ВыбранныеПодразделения.Вставить(Правило[ИмяПоля]);
		КонецЦикла;
		
	КонецЦикла;
	
	ПодразделенияТаблица = Новый ТаблицаЗначений;
	ПодразделенияТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	Для Каждого ОписаниеПодразделения Из ВыбранныеПодразделения Цикл
		Если Не ЗначениеЗаполнено(ОписаниеПодразделения.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		ПодразделенияТаблица.Добавить().Подразделение = ОписаниеПодразделения.Ключ;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПодразделенияТаблица) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   Настройки.Контекст.Организация);
	Запрос.УстановитьПараметр("Подразделения", ПодразделенияТаблица);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Подразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ Подразделения
	|ИЗ
	|	&Подразделения КАК Подразделения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Подразделения.Подразделение КАК Подразделение
	|ИЗ
	|	Подразделения КАК Подразделения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|		ПО Подразделения.Подразделение = ПодразделенияОрганизаций.Ссылка
	|			И (ПодразделенияОрганизаций.Владелец = &Организация)
	|ГДЕ
	|	ПодразделенияОрганизаций.Ссылка ЕСТЬ NULL";
	
	НедопустимыеПодразделения = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НедопустимыеПодразделения.Вставить(Выборка.Подразделение, Истина);
	КонецЦикла;
	
	Для Каждого Правило Из Настройки.ОсобыеПравилаРаспределения Цикл
		
		Для Каждого ИмяПоля Из ПоляПодразделение Цикл
			ПроверяемоеПодразделение = Правило[ИмяПоля];
			Если НедопустимыеПодразделения[ПроверяемоеПодразделение] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Правило[ИмяПоля] = Неопределено;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура СоздатьЭлементы() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		// Создает новые записи, поэтому выполняется централизованно
		Возврат;
	КонецЕсли;
	
	// Получим все настройки учета затрат из учетной политики.
	// Внутренние соединения со справочниками позволяют исключать из обработки некорректные записи.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитика.Период КАК Период,
	|	УчетнаяПолитика.Организация КАК Организация,
	|	УчетнаяПолитика.НастройкиУчетаЗатрат КАК НастройкиУчетаЗатрат
	|ПОМЕСТИТЬ ЗаписиУчетнойПолитики
	|ИЗ
	|	РегистрСведений.УчетнаяПолитика КАК УчетнаяПолитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО УчетнаяПолитика.Организация = Организации.Ссылка
	|ГДЕ
	|	(УчетнаяПолитика.НастройкиУчетаЗатрат.БазаРаспределения ЕСТЬ NULL
	|			ИЛИ УчетнаяПолитика.НастройкиУчетаЗатрат.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияКосвенныхРасходов.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МетодыРаспределения.Период КАК Период,
	|	МетодыРаспределения.Организация КАК Организация
	|ПОМЕСТИТЬ ПромежуточныеЗаписи
	|ИЗ
	|	РегистрСведений.УдалитьМетодыРаспределенияКосвенныхРасходовОрганизаций КАК МетодыРаспределения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО МетодыРаспределения.Организация = Организации.Ссылка
	|ГДЕ
	|	НЕ (МетодыРаспределения.Период, МетодыРаспределения.Организация) В
	|				(ВЫБРАТЬ
	|					ЗаписиУчетнойПолитики.Период,
	|					ЗаписиУчетнойПолитики.Организация
	|				ИЗ
	|					ЗаписиУчетнойПолитики)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиУчетнойПолитики.Период КАК Период,
	|	ЗаписиУчетнойПолитики.Организация КАК Организация,
	|	ЗаписиУчетнойПолитики.НастройкиУчетаЗатрат КАК НастройкиУчетаЗатрат,
	|	ИСТИНА КАК СуществуетЗаписьУчетнойПолитики
	|ИЗ
	|	ЗаписиУчетнойПолитики КАК ЗаписиУчетнойПолитики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПромежуточныеЗаписи.Период,
	|	ПромежуточныеЗаписи.Организация,
	|	ЗНАЧЕНИЕ(Справочник.НастройкиУчетаЗатрат.ПустаяСсылка),
	|	ЛОЖЬ
	|ИЗ
	|	ПромежуточныеЗаписи КАК ПромежуточныеЗаписи
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Период
	|ИТОГИ ПО
	|	Организация";
	
	ВыборкаОрганизация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ПредыдущаяЗаписьУчетнойПолитики = Неопределено;
		
		ВыборкаЗапись = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗапись.Следующий() Цикл
			
			ИсточникНастроекУчетаЗатрат = Неопределено;
			
			Если ВыборкаЗапись.СуществуетЗаписьУчетнойПолитики Тогда
				
				ИсточникНастроекУчетаЗатрат = ВыборкаЗапись.НастройкиУчетаЗатрат;
				
				МенеджерЗаписи = РегистрыСведений.УчетнаяПолитика.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаЗапись);
				МенеджерЗаписи.Прочитать();
				
				ПредыдущаяЗаписьУчетнойПолитики = МенеджерЗаписи;
				
			ИначеЕсли ПредыдущаяЗаписьУчетнойПолитики = Неопределено Тогда
				
				Продолжить;
				
			Иначе
				
				ИсточникНастроекУчетаЗатрат = ПредыдущаяЗаписьУчетнойПолитики.НастройкиУчетаЗатрат;
				
				МенеджерЗаписи = РегистрыСведений.УчетнаяПолитика.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПредыдущаяЗаписьУчетнойПолитики);
				МенеджерЗаписи.Период = ВыборкаЗапись.Период;
				МенеджерЗаписи.НастройкиУчетаЗатрат = Неопределено;
				
				ПредыдущаяЗаписьУчетнойПолитики = МенеджерЗаписи;
				
			КонецЕсли;
			
			Настройки = НовыйБазовыеНастройкиУчетаЗатрат();
			
			ЗаполнитьЗначенияСвойств(Настройки.Контекст, ВыборкаЗапись);
			
			Если Не ЗначениеЗаполнено(ИсточникНастроекУчетаЗатрат) Тогда
				ЗаполнитьПоУмолчанию(Настройки);
			Иначе
				ПрочитатьСсылку(Настройки, ИсточникНастроекУчетаЗатрат);
			КонецЕсли;
			
			РегистрыСведений.УдалитьМетодыРаспределенияКосвенныхРасходовОрганизаций.ПрочитатьНастройки(
				Настройки,
				ВыборкаЗапись.Период,
				ВыборкаЗапись.Организация);
			
			Исправить(Настройки);
			
			Попытка
				РегистрыСведений.УчетнаяПолитика.Записать(МенеджерЗаписи, Настройки);
			Исключение
				
				// Обработчик обновления - сервисный.
				// Если он не будет выполнен, то продолжать работу можно.
				
				// Обработка возможных нарушений стандарта разработки
				// в вызываемом коде библиотек
				Пока ТранзакцияАктивна() Цикл
					ОтменитьТранзакцию();
				КонецЦикла;
				
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'ОбработкаОбновления'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.РегистрыСведений.УчетнаяПолитика,
					,
					ОписаниеОшибки());
					
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
